public class Main {
    public static void main(String[] args) {
        Reader[] readers = {
                new Reader("Шорников И.Д.", 1, "Математический", "05.03.1980", "+79273662678"),
                new Reader("Петров В.В.", 2, "Гуманитарный", "03.02.2013", "+792462792179"),
                new Reader("Сазонова И.П.", 3, "Технический", "04.05.1979", "+79374121721"),
                new Reader("Кузнецов М.В.", 4, "Инженерный", "05.04.2005", "+7561651231"),
                new Reader("Синельников А.В.", 5, "Экономический", "27.04.2001", "+79273658266")
        };
        readers[1].takeBook(3);
        readers[1].takeBook("Приключения", "Словарь", "Энциклопедия");
        readers[1].returnBook(3);
        readers[1].returnBook("Приключения", "Словарь", "Энциклопедия");
    }
}